In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.ion()
import seaborn as sns
sns.set()

In [91]:
df = pd.read_csv('price_neigberhood_m2.csv')
df.head()

   Dto.          Barrios     2013   2014   2015   2016   2017
0     1        1. el Raval  2.614  2.404  2.775  3.251  4.029
1     1  2. el Barri Gòtic  3.811  3.791  4.236  4.813  4.884
2     1  3. la Barceloneta  4.212  4.168  4.043  4.683  5.165
3     1       4. Sant Pere  3.534  3.682  3.827  4.501  5.152
4     2   5. el Fort Pienc  3.038  3.022  3.228  4.012  4.107

In [92]:
df.isnull().sum()

Dto.            0
   Barrios      0
2013            0
2014            0
2015            0
2016            0
2017            0
dtype: int64

In [93]:
df = df.replace('n.d.  ', np.nan)
df.head()

   Dto.          Barrios     2013   2014   2015   2016   2017
0     1        1. el Raval  2.614  2.404  2.775  3.251  4.029
1     1  2. el Barri Gòtic  3.811  3.791  4.236  4.813  4.884
2     1  3. la Barceloneta  4.212  4.168  4.043  4.683  5.165
3     1       4. Sant Pere  3.534  3.682  3.827  4.501  5.152
4     2   5. el Fort Pienc  3.038  3.022  3.228  4.012  4.107

In [94]:
df.iloc[[39]]

    Dto.        Barrios   2013 2014 2015 2016 2017
39     7  40. Montbau (1)

In [95]:
df = df.replace(' ', np.nan)

In [96]:
df['2013'] = pd.to_numeric(df['2013'])
df['2014'] = pd.to_numeric(df['2014'])
df['2015'] = pd.to_numeric(df['2015'])
df['2016'] = pd.to_numeric(df['2016'])
df['2017'] = pd.to_numeric(df['2017'])

In [104]:
df.Barrios.is_unique

True

In [99]:
df.columns = df.columns.str.strip()

In [89]:
df.columns

Index(['2013', '2014', '2015', '2016', '2017'], dtype='object')

In [22]:
df.size

511

In [23]:
df.isnull().sum()

Dto.        0
Barrios     0
2013       31
2014       14
2015       14
2016       13
2017       17
dtype: int64

In [24]:
df.fillna(0, inplace=True)